[{ "id": "1", "url": "/programming/2019/07/26/is-rust-good-for-apps", "title": "Rust as an App Language", // "excerpt": " There is a strong need to work with typical business logic operations in a platform-agnostic manner for increased code re-use, reduced dependencies, and higher performance. Consider Rust. The language is a prime candidate for replacing C++, at large, as a systems language but can it also serve the needs of general consumer applications? This article is written for somebody interested in how Rust can be used by someone with experience in other modernized application programming languages like Swift and Kotlin.", "categories": "Programming" } ,{ "id": "2", "url": "/software-architecture/2019/06/23/multiplatform-architecture-with-shared-libraries", "title": "Multiplatform Architecture", // "excerpt": " Figure 1: An architecture based on shared libraries in a middleware layer (with an optional shared view model) to serve delivery of client apps to multiple native platform targets. ", "categories": "Software-Architecture" } ,{ "id": "3", "url": "/programming/2019/05/29/kotlin-json-processing", "title": "Kotlin for Concise JSON Pre-Processing", // "excerpt": " Figure 1: UBER open vs close. Raw stock price data was pre-processed, or transformed, with a Kotlin program and exported to a CSV format. The results were then plotted. Data source: Alpha Vantage.", "categories": "Programming" } ,{ "id": "4", "url": "/macos/2018/08/20/drag-and-drop-mac-fsharp", "title": "Drag-and-Drop for macOS in F#", // "excerpt": " Figure 1: Dragging-and-Dropping multiple files into a window from the Finder. ", "categories": "macOS" } ,{ "id": "5", "url": "/machine-learning/2018/06/24/python-for-ml", "title": "Manage Python for Machine Learning on macOS", // "excerpt": " It behooves me to address machine learning as a separate field from softwareengineering due to it having a different focus while rapidly expanding inimportance. I’m not just jumping on the bandwagon either as I started with MLprojects and coursework around 10 years ago.", "categories": "machine-learning" } ,{ "id": "6", "url": "/reactive-programming/2017/05/15/promises-are-a-bridge-to-reactive", "title": "Chaining Reactive Operations versus Promise Chains", // "excerpt": " Figure 1: A bridge is something that helps you get from one place of understanding to another. ", "categories": "reactive-programming" } ,{ "id": "7", "url": "/open-source/2017/03/15/swift-script-for-detecting-silence-in-audio-files", "title": "A Swift Script for Detecting Silence in Audio Files", // "excerpt": " Figure 1: A stereo waveform with unexpected silence. ", "categories": "open-source" } ,{ "id": "8", "url": "/tutorials/2017/03/01/firebase-json-data-model-objects-swift", "title": "Make Model Objects from Firebase JSON Data in Swift", // "excerpt": " Your app’s data model defines the value that you are going to deliver to the world through your creation. The kinds of information we can consume or create with your app are enabled by this fundamental software component. It tells us whether your app can serve a gourmet palate or if it is only there to be a snack.", "categories": "tutorials" } ,{ "id": "9", "url": "/tutorials/2016/08/19/firebase-user-roles", "title": "Quickly Implement User Roles in Firebase", // "excerpt": " Today, I have a look at Firebase security rules for the purpose of implementing user roles. I share a quick example that includes both a database and corresponding rules to help you get up to speed with the format.", "categories": "tutorials" } ,{ "id": "10", "url": "/tutorials/2016/07/21/ubuntu-vm-samba-mac", "title": "Fastest Setup of Samba in an Ubuntu Server Virtual Machine on a Mac", // "excerpt": " This is the fastest and easiest guide to getting Samba running on an Ubuntu Server virtual machine so that files can be accessed in the Mac Finder.", "categories": "tutorials" } ,{ "id": "11", "url": "/tips/2016/05/04/keep-spark-inspector-available-in-xcode", "title": "Repair Spark Inspector Availability in Xcode", // "excerpt": " Keeping Spark Inspector working across new versions of Xcode has been like trying to keep a house of cards upright on a windy day. I’m sharing how I successfully re-enabled the plugin after upgrading to Xcode 7.3.1. After the procedure, the plugin is available under the Debug and Product menus in Xcode.Neither their website nor the plugin seems to have been updated recently but I still find it useful for certain debugging situations and that’s why I’m sharing this info.", "categories": "tips" } ,{ "id": "12", "url": "/tips/2016/03/28/setup-xcode-derived-data-ram-disk", "title": "Build Apps Faster Than Ever Before", // "excerpt": " Would you prefer the time it takes to compile and link your app to be faster or slower?", "categories": "tips" } ,{ "id": "13", "url": "/tips/2016/02/02/easy-install-rac4-with-cocoapods", "title": "Easy Install of ReactiveCocoa 4 Using CocoaPods", // "excerpt": " I’ve gone through the full manual installation of RAC4 using Git submodules and it’s not that bad but CocoaPods makes it easier to get it going. Using Carthage is another option and one that I may make a comparison with at a later date.", "categories": "tips" } ,{ "id": "14", "url": "/experiences/2016/02/01/signal-chaining-in-reactivecocoa-4-for-cloudkit", "title": "Signal Chaining in ReactiveCocoa 4 for CloudKit", // "excerpt": " With Parse going away, the quest for alternatives begins. CloudKit is one option. No matter what backend one may choose, there are inherent frailties within any app that relies on a backend. Sometimes these weaknesses are only revealed under significant loads or unusual usage patterns and are often a result of a flawed handling of concurrency.", "categories": "experiences" } ,{ "id": "15", "url": "/experiences/2016/01/15/mvvm-in-swift-with-reactivecocoa4", "title": "MVVM in Swift with ReactiveCocoa 4", // "excerpt": " Figure 1: MVC vs MVVM. MVVM is roughly the same as MVC with the addition of a data layer in the form of the View Model that takes over interacting with the Model layer to provide data for presentation by the View layer. ", "categories": "experiences" } ,{ "id": "16", "url": "/tips/2016/01/10/cancel-button-for-google-drive-login", "title": "Making It So Users Can Cancel a Google Drive Login on iOS 9", // "excerpt": " In working with the Google Drive SDK for iOS, one can appreciate its broad support for many different use cases including multiple iOS versions. Perhaps further updates are necessary as using the library in a Swift world requires significant effort.", "categories": "tips" } ,{ "id": "17", "url": "/experiences/2016/01/06/rac4-concurrency-lesson", "title": "ReactiveCocoa 4 Signals Teach Us an Important Lesson About Concurrency", // "excerpt": " You may come across this situation while working with RAC4:", "categories": "experiences" } ,{ "id": "18", "url": "/experiences/2016/01/03/promises-in-ios", "title": "My First Peek at Promises in Swift on iOS and OS X", // "excerpt": " There’s a certain tedium in implementing asynchronous operations using the typical patterns common in apps. Typically every call requires a completion handler that either handles the result or handles an error.", "categories": "experiences" } ,{ "id": "19", "url": "/tips/2016/01/02/talking-through-delegation", "title": "Talking Through Delegates and Protocols for iOS and OS X", // "excerpt": " Delegation is probably not easy to grasp for most. It certainly wasn’t for me. I want to change that by putting it in a way that can be understood by my readers and students. Of all things, delegation is one of the most characteristic patterns found throughout iOS and OS X development. I’d argue that it is one of the cornerstones of apps for the Apple ecosystem. It’s a rather perfect mechanism for updating the UI after background operations.", "categories": "tips" } ,{ "id": "20", "url": "/experiences/2016/01/01/cpp-in-xcode-part-1", "title": "C++ and Swift in Xcode Part 1", // "excerpt": " C++ was the programming language in which I first learned object-oriented programming. I’m now going back to it for integrating it with Objective-C and Swift in Xcode. I’ve always found that building software in other languages can enhance my understanding of programming in a way that goes beyond even advanced study of a single language.", "categories": "experiences" } ,{ "id": "21", "url": "/experiences/2015/12/31/search-for-jekyll", "title": "Live Lunr Search for Jekyll", // "excerpt": " Getting live search working in Jekyll was a real accomplishment but the results displayed still need some improvement. For instance, dates are not showing up yet for posts.", "categories": "experiences" } ,{ "id": "22", "url": "/tips/2015/12/30/setting-voice-for-tts-in-ios", "title": "Changing Voices in Swift for iOS", // "excerpt": " When your phone speaks to you, what voice is it using?", "categories": "tips" } ,{ "id": "23", "url": "/tips/2015/12/27/jekyll-compressing", "title": "Making Jekyll Faster by Compressing CSS", // "excerpt": " Compressing CSS source can provide a noticeable performance increase for a static blog. I’ve found this to have made a considerable difference on mobile.Setting up a pipeline for compressing resources is possible in Jekyll. After trying many of the existing guides out there without success, I finally found a solution that worked for me and I’m sharing it here.", "categories": "tips" } ,{ "id": "24", "url": "/tips/2015/12/21/jekyll-is-the-blog-parser-fix-yourself", "title": "Jekyll Code Highlights Conflict with Post Excerpts", // "excerpt": " Jekyll is known as a hacker’s blog parser for a reason and that is because you have to fix its problems yourself to get it to work. The satisfaction you will get from not having to rely on other blogging platforms and their associated overhead will make it worthwhile. There is also a large community that can help you.", "categories": "tips" } ,{ "id": "25", "url": "/tips/2015/12/20/using-custom-fonts-in-ios-osx", "title": "Changing the Feel of Your iOS or OS X App with Custom Fonts", // "excerpt": " Your app can be more attractive and feel better to users by using custom fonts. Getting them installed and using them is a little tricky.", "categories": "tips" } ,{ "id": "26", "url": "/tips/2015/12/19/path-ordering-in-bash", "title": "Path Ordering in Bash", // "excerpt": " Making smart use of bash and scripts written for bash can help you have more time for more important things than administering your system.", "categories": "tips" }]